
## Plan Result (prod)

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225549390)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 4 to destroy.</code></pre>

* Create
  * module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret
  * module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version
  * module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret
  * module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version
* Update
  * module.lambda.aws_iam_role_policy.lambda_secret_manager_policy
  * module.lambda.aws_lambda_function.lambda
* Delete
  * module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret[&#34;slack-bot-token&#34;]
  * module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret[&#34;slack-signing-secret&#34;]
  * module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version[&#34;slack-bot-token&#34;]
  * module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version[&#34;slack-signing-secret&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secret_manager_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda.aws_iam_role_policy.lambda_secret_manager_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_secret_manager_policy" {
        id          = "lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy"
        name        = "lambda-bot-prod-secret-manager-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3",
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "lambda-bot-prod"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:7/invocations" -> (known after apply)
        tags                           = {
            "Name" = "lambda-bot-prod"
        }
      ~ version                        = "7" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SLACK_BOT_TOKEN"      = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
              - "SLACK_SIGNING_SECRET" = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"] will be destroyed
  # (because aws_secretsmanager_secret.secretsmanager_secret is not in configuration)
  - resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - name                           = "slack-bot-token" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"] will be destroyed
  # (because aws_secretsmanager_secret.secretsmanager_secret is not in configuration)
  - resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - name                           = "slack-signing-secret" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"] will be destroyed
  # (because aws_secretsmanager_secret_version.secretmanager_secret_version is not in configuration)
  - resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      - arn              = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - id               = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3|terraform-20250524082129800400000004" -> null
      - secret_id        = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20250524082129800400000004" -> null
      - version_stages   = [
          - "AWSPREVIOUS",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"] will be destroyed
  # (because aws_secretsmanager_secret_version.secretmanager_secret_version is not in configuration)
  - resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      - arn              = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - id               = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3|terraform-20250524082129799000000003" -> null
      - secret_id        = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20250524082129799000000003" -> null
      - version_stages   = [
          - "AWSPREVIOUS",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-bot-token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-signing-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```

</details>




## :warning: Errors

* add a label prod/destroy: POST https://api.github.com/repos/goda6565/lambda-bot/issues/11/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"dfe996262ab5f2e729e18ceea60c999ab5a322c6","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->